01  WS-AREA.
    05  WS-NUMBER PIC 9(7) VALUE 99999. 
    05  WS-FLAG PIC X VALUE 'N'.

PROCEDURE DIVISION.
    PERFORM 100-PROCESS-NUMBER.
    STOP RUN.

100-PROCESS-NUMBER SECTION.
    IF WS-NUMBER > 10000 THEN
        MOVE 'Y' TO WS-FLAG
    ELSE
        MOVE 'N' TO WS-FLAG
    END-IF.
    DISPLAY 'Flag: ' WS-FLAG
    GOBACK.